tutorials/Coupled/2D_example_steady_PNPFoam_Sang_clone/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1;

phiDyMBoundary
{
	name	top;
	phiStart	0;
	phiEnd		25;
	phiInterval	1;
}

Ions
{
    ionsList(C1,C2); 

	C1
	{
		variableName C1; 		
		z z [0 0 0 0 0 0 0] 1; // valence
		D D [0 -3 -1 0 0 0 0] 1.33e-9; // diffusivity
	}

	C2
	{
		variableName C1; 		
		z z [0 0 0 0 0 0 0] -1; // valence
		D D [0 -3 -1 0 0 0 0] 2.03e-9; // diffusivity
 	}
}
floatingChargeVolumes 
{
   volumes (frontAndBack);
   top  {N 0;}
   
} 
Desalination
{
	Cation C1;
	Anion C2; 
	desalinationInlet (top);
	desalinationOutlet (bottom);
	Mem1Name  bottom;
        Mem2Name  top;
	//membraneName (left_mem right_mem)) ;
	//membraneType curve;
	desaltType ICP;

	Potential Phi;
	Velocity U;
 	Pressure p;

}
ElectrokineticAnalysis
{
	calculatePowerDissipation no;
	writeIonicFluxBoundary no;
  	calculateIVresponse yes; 
}


Electrolyte
{
  	Cation C1;
	Anion C2; 

	Potential Phi;
	Velocity U;
  	Pressure p;

    l0              l0 [0 1 0 0 0 0 0] 10e-6; // length-scale 
    C0              C0 [0 -3 0 0 1 0 0] 1; // Bulk Concentration   
    T               T  [0 0 0 1 0 0 0] 300; // Absolute temperature    
    e               e  [0 0 1 0 0 1 0] 1.60217646e-19; // elementary charge
    kB              kB [1 2 -2 -1 0 0 0] 1.38065e-23; // Bolt-Zmann constant
    F               F  [0 0 1 0 -1 1 0] 96485.3415; // Faraday constant
    NA              NA [0 0 0 0 -1 0 0] 6.0221415e23; // Avogadro's number 
    eps0          eps0 [0 -1 1 0 -1 1 0] 8.8541878e-12; // vacumm permittivity
    epsr          epsr [0 0 0 0 0 0 0] 80; // dielectric constant 
    mu              mu [1 -1 -1 0 0 0 0] 1e-3; // dynamic viscosity
    rho            rho [1 -3 0 0 0 0 0] 1000; // density
    nu              nu [0 2 -1 0 0 0 0] 1; // kinematic viscosity 
    wsc            wsc [0 -2 1 0 0 1 0] -2e-3 ; // Wall's Surface Charge   
/*    z1              z1 [0 0 0 0 0 0 0]  1; // C1 valence
    z2              z2 [0 0 0 0 0 0 0] -1; // C2 valence
    D1              D1 [0 -3 -1 0 0 0 0] 1.33e-9; // C1 diffusivity
    D2              D2 [0 -3 -1 0 0 0 0] 2.03e-9; // C2 diffusivity*/
}

// ************************************************************************* //
